Repository: NaN-tic/trytond-dbcopy
Catalog: locale/*.po
Languages: ca, ca_es, es, es_es

# error:dbcopy.createdb:
source: Database %(source)s cloned successfully into %(target)s. Now you can connect to the new database.
ca_es: Base de datos %(source)s duplicada correctamente dentro de %(target)s. Ahora ya puedes conectarte a la nueva base de datos.
es_es: Base de datos %(source)s duplicada correctamente dentro de %(target)s. Ya se puede conectar a la nueva base de datos.

# error:dbcopy.createdb:
source: Error connection to new test database. Please, create new test database or contact us.
ca_es: Error en la connexió a la nova base de dades. Crea de nou la copia o contacti amb nosaltres.
es_es: Error en la conexión a la nueva base de datos. Cree de nuevo una nueva copia o contacte con nosotros.

# error:dbcopy.createdb:
source: Error creating database %s.
ca_es: Error creant la base de dades %s.
es_es: Error creando la base de datos %s.

# error:dbcopy.createdb:
source: Error dropping database %s.
ca_es: Error esborrant la base de dades %s.
es_es: Error borrando la base de datos %s.

# error:dbcopy.createdb:
source: Error dumping database %s.
ca_es: Error copiando la base de datos %s.
es_es: Error copiando la base de datos %s.

# error:dbcopy.createdb:
source: Error restoring database %s.
ca_es: Error restaurant la base de dades %s.
es_es: Error restaurando la base de datos %s.

# error:dbcopy.createdb:
source: To prevent removal of valid data, target database must contain "test" in its name.
ca_es: Para prevenir eliminar datos validos, la base de datos destion tiene que contener "test" en el nombre.
es_es: Para prevenir la eliminacion de datos validos, la base de datos de destino ha de contener, "test" en el nombre.

# error:dbcopy.createdb:
source: Tryton dbcopy result of clone database %s
ca_es: Resultat de Trytond dbcopy de clonació de base de dades %s
es_es: Resultado de Trytond dbcopy de clonación de la base de datos %s

# error:dbcopy.createdb:
source: User %s has not got any email address.
ca_es: L'usuari %s no té cap adreça de correu electrònic.
es_es: El usuario %s no tiene ninguna dirección de correo electrónico.

# error:dbcopy.createdb:
source: You can not clone a database from a test database. Connect to live database and clone a new test database.
ca_es: No pot clonar una base de dades que l'orígen ja es una copia. Connectis a la base de dades de producció i cloni una nova base de dades.
es_es: No puede clonar una base de datos que el orígen ya es una copia. Connecte a la base de datos de producción y clone una nueva base de datos.

# error:dbcopy.createdb:
source: You cannot overwrite current database.
ca_es: No puedes sobreescrivir la base de datos.
es_es: No se puede sobrescribir la base de datos.

# error:dbcopy.createdb:
source: You database is not PSQL. Can not copy your database
ca_es: La base de dades no es PSQL. No es pot copiar la base de dades
es_es: La base de datos no es PSQL. No se puede copiar la base de datos

# field:dbcopy.createdb.result,name:
source: DB Name
ca: Nom base de dades
ca_es: Nom base de dades
es: Nombre base de datos
es_es: Nombre de la base de datos

# field:dbcopy.createdb.start,source_database:
source: Database Name
ca_es: Nombre base de datos
es_es: Nombre de la base de datos

# field:dbcopy.createdb.start,source_password:
source: Database Password
ca_es: Contraseña
es_es: Contraseña

# field:dbcopy.createdb.start,source_username:
source: Database User
ca_es: Usuario
es_es: Usuario

# field:dbcopy.createdb.start,target_database:
source: Database Name
ca_es: Nombre base de datos
es_es: Nombre de la base de datos

# field:dbcopy.createdb.start,target_password:
source: Database Password
ca_es: Contraseña
es_es: Contraseña

# field:dbcopy.createdb.start,target_username:
source: Database User
ca_es: Usuario
es_es: Usuario

# model:dbcopy.createdb.result,name:
source: Create DB Copy
ca: Crea una base de dades copia
ca_es: Crea una base de dades copia
es: Crear base de datos copia
es_es: Crear base de datos copia

# model:dbcopy.createdb.start,name:
source: Create DB Copy
ca: Crea una base de dades copia
ca_es: Crea una base de dades copia
es: Crear base de datos copia
es_es: Crear base de datos copia

# model:ir.action,name:act_dbcopy_createdb
source: Create DB Copy
ca: Crea una base de dades copia
ca_es: Crea una base de dades copia
es: Crear base de datos copia
es_es: Crear base de datos copia

# model:ir.ui.menu,name:menu_dbcopy
source: DB Copy
ca: Copia base de dades
ca_es: Copia base de dades
es: Copia base de datos
es_es: Copia base de datos

# model:ir.ui.menu,name:menu_dbcopy_createdb
source: Create DB Copy
ca: Crea una base de dades copia
ca_es: Crea una base de dades copia
es: Crear base de datos copia
es_es: Crear base de datos copia

# view:dbcopy.createdb.result:
source: DB Copy
ca: Copia base de dades
ca_es: Copia base de dades
es: Copia base de datos
es_es: Copia base de datos

# view:dbcopy.createdb.result:
source: Tryton Server has started to clone Database. You cannot connect to the database until you have received a mail notifying that you can do it.
ca_es: El servidor ha iniciat el procés de clonació de la base de dades. No es podrà connectar a la base de dades fins que rebi el correu electrònic que li indicarà que ja es troba operatiu.
es_es: El servidor ha iniciado el proceso de clonación de la base de datos. No se podrá conectar a la base de datos hasta recibir el correo electrónico que le indicará que se encuentra operativo.

# view:dbcopy.createdb.start:
source: DB Copy
ca: Copia base de dades
ca_es: Copia base de dades
es: Copia base de datos
es_es: Copia base de datos

# view:dbcopy.createdb.start:
source: It clones a production database to test. This action need some time to generate the database so, try to connect later.
ca_es: Clona la base de dades de producció per testeig. Aquesta acció necessita cert temps per generar la base de dades, per tant, intenti connectar més tard.
es_es: Clona la base de datos de producción para pruebas. Esta acción requiere algo de tiempo para generar la base de datos, por lo que, trate de conectarse más tarde.

# view:dbcopy.createdb.start:
source: Soruce
ca_es: Orígen
es_es: Origen

# view:dbcopy.createdb.start:
source: Target
ca_es: Destino
es_es: Destino

# view:dbcopy.createdb.start:
source: Warning! It is strongly recommended not to clone the database when other people are working on the ERP because this process stops any action they were performing.
ca_es: Atenció! Es recomana encaridament no clonar la base de dades quan altres persones estan treballant a l'ERP perque aquest procés atura qualsevol acció que estiguessin realitzant.
es_es: ¡Atención! Se Recomienda encarecidamente no clonar la base de datos cuando otras personas están trabajando en el ERP porque este proceso detiene cualquier acción que estuvieran realizando.

# wizard_button:dbcopy.createdb,result,end:
source: Close
ca: Tanca
ca_es: Tanca
es: Cerrar
es_es: Cerrar

# wizard_button:dbcopy.createdb,start,createdb:
source: Create database copy
ca: Crea una base de dades copia
ca_es: Crea una base de dades copia
es: Crear una base de datos copia
es_es: Crear una base de datos copia

# wizard_button:dbcopy.createdb,start,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# model:ir.message,text:cannot_overwrite
source: You cannot overwrite current database.
ca: No podeu sobreescriure la base de dades actual.
es: No puedes sobrescribir la base de datos actual.

# model:ir.message,text:db_cloned_successfully
source: Database "%(source)s" cloned successfully into "%(target)s". Now you can connect to the new database
ca: La base de dades "%(source)s" s'ha clonat amb éxit a "%(target)s". Ara podeu connectar-vos a la nova base de dades.
es: Base de datos "%(source)s" clonada con éxito en "%(target)s". Ahora puede conectarse a la nueva base de datos.

# model:ir.message,text:connection_error
source: Error connection to new test database. Please, create new test database or contact us.
ca: Error en la connexió a la nova base de dades. Crea de nou la copia o contacti amb nosaltres.
es: Error en la conexión a la nueva base de datos. Cree de nuevo una nueva copia o contacte con nosotros.

# model:ir.message,text:dumping_db_error
source: Error dumping database "%(source)s".
ca: Error bolcant la base de dades "%(source)s".
es: Error volcando la base de datos "%(source)s".

# model:ir.message,text:creating_db_error
source: Error creating database "%(source)s".
ca: Error creant la base de dades "%(source)s".
es: Error creando la base de datos "%(source)s".

# model:ir.message,text:dropping_db_error
source: Error dropping database "%(source)s".
ca: Error esborrant la base de dades "%(source)s".
es: Error borrando la base de datos "%(source)s".

# model:ir.message,text:restoring_db_error
source: Error restoring database "%(source)s".
ca: Error restaurant la base de dades "%(source)s".
es: Error restaurando la base de datos "%(source)s".

# model:ir.message,text:email_subject
source: Tryton dbcopy result of clone database "%(source_database)s"
ca: Resultat de Trytond dbcopy de clonació de base de dades "%(source_database)s"
es: Resultado de Trytond dbcopy de clonación de la base de datos "%(source_database)s"

# model:ir.message,text:user_email_error
source: User "%(user)s" has not got any email address.
ca: L'usuari "%(user)s" no té cap adreça de correu electrònic.
es: El usuario "%(user)s" no tiene ninguna dirección de correo electrónico.

# model:ir.message,text:dbname_error
source: You can not clone a database from a test database. Connect to live database and clone new test database.
ca: No pot clonar una base de dades que l'orígen ja es una copia. Connectis a la base de dades de producció i cloni una nova base de dades.
es: No puede clonar una base de datos que el orígen ya es una copia. Connecte a la base de datos de producción y clone una nueva base de datos.

# model:ir.message,text:dbname_scheme
source: You database is not PSQL. Can not copy your database
ca: La base de dades no es PSQL. No es pot copiar la base de dades
es: La base de datos no es PSQL. No se puede copiar la base de datos

# field:dbcopy.createdb.start,database:
source: Database Name
ca: Nombre base de datos
es: Nombre base de datos

# field:dbcopy.createdb.start,username:
source: Database User
ca: Usuari del servidor
es: Usuario del servidor

# field:dbcopy.createdb.start,password:
source: Database Password
ca: Contrasenya del servidor
es: Contraseña del servidor

# view:dbcopy.createdb.result:
source: Tryton Server has started to clone Database. You cannot
ca: El servidor ha iniciat el procés de clonació de la
es: El servidor ha iniciado el proceso de clonación de la base de datos. No se

# view:dbcopy.createdb.result:
source: connect to the database until you have received a mail notifying
ca: base de dades. No es podrà connectar a la base de dades fins
es: podrá conectar a la base de datos hasta recibir el correo electrónico que le

# view:dbcopy.createdb.result:
source: that you can do it.
ca: que rebi el correu electrònic que li indicarà que ja es troba operatiu.
es: indicará que se encuentra operativo.

# view:dbcopy.createdb.start:
source: It clones a production database to test. This action need some time
ca: Clona la base de dades de producció per testeig. Aquesta acció necessita
es: Clona la base de datos de producción para pruebas. Esta acción requiere algo

# view:dbcopy.createdb.start:
source: to generate the database so, try to connect later.
ca: cert temps per generar la base de dades, per tant, intenti connectar més tard.
es: de tiempo para generar la base de datos, por lo que, trate de conectarse más tarde.

# view:dbcopy.createdb.start:
source: Warning! It is strongly recommended not to clone the database when other
ca: Atenció! Es recomana encaridament no clonar la base de dades quan altres
es: ¡Atención! Se Recomienda encarecidamente no clonar la base de datos cuando otras

# view:dbcopy.createdb.start:
source: people are working on the ERP because this process stops
ca: persones estan treballant a l'ERP perque aquest procés atura qualsevol acció
es: personas están trabajando en el ERP porque este proceso detiene

# view:dbcopy.createdb.start:
source: any action they were performing.
ca: que estiguessin realitzant.
es: cualquier acción que estuvieran realizando.
